app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)
    @profile.id = params[:user_id]
    @profile.user_id = params[:user_id]

    if @profile.save
---
INSERT INTO "profiles" ("nickname", "description", "profilePicture", "readingGoal", "totalPageNum", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"